import task2_reverse_word
import task3_print_asterisks
import task7_copy_list
import task8_find_lists_difference
import tasks4_5_numbers_sequence
import task6_delete_duplicates_list

# Task 2:
# Напишите программу Python, которая принимает слово от
# пользователя и переворачивает его
# Пример:
# input - Hello Worlds
# output - sdlroW olle
# print('Task 2: reverse word')
# task2_reverse_word.reverse_word()
#
# # Task 3:
# # Напишите программу Python для построения следующего шаблона,
# # используя вложенный цикл for.
# # *
# # * *
# # * * *
# # * * * *
# # * * * * *
# # * * * *
# # * * *
# # * *
# # *
# print('\nTask 3: asterisks')
# task3_print_asterisks.print_asterisks()
#
# # Task 4:
# # Даны два целых числа A и В. Выведите все числа от A до B включительно,
# # в порядке возрастания, если A < B, или в порядке убывания если A > B
# print('\nTask 4: int numbers from a to b')
# max_number = 20
# tasks4_5_numbers_sequence.print_sequence_random(max_number)
#
# # Task 5:
# # Даны два целых числа A и B (при этом A < B).
# # Выведите все числа от A до B включительно.
# print('\nTask 5: int numbers from a to b, where a < b')
# tasks4_5_numbers_sequence.print_sequence_a_less_b(max_number)
#
# # Task 6:
# # Напишите программу, которая удаляет дубликаты элементов из списка.
# print('\nTask 6: delete duplicates from the list')
# task6_delete_duplicates_list.delete_duplicates()
#
# # Task 7:
# # Напишите программу, которая копирует список
# print('\nTask 7: copy list')
# task7_copy_list.copy_list()

# Task 8:
# Напишите программу, которая находит разницу между
# двумя списками и сохраняет ее в новый список. Вывести
# результат на экран.
print('\nTask 8: find difference between list_1 and list_2')
task8_find_lists_difference.find_difference()

# Task 9:
# Напишите программу для объединения следующих словарей для создания нового
# Исходные словари :
# dic1={1:10, 2:20}
# dic2={3:30, 4:40}
# dic3={5:50,6:60}
# Результат : {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}
print('\nTask 9: append 3 dictionaries')